# if ($http_x_forwarded_for ~ ".+,.+"){return 403;}
# if ($http_cf_connecting_ip !~* "182.239.93.5|182.239.121.145|182.239.117.198|182.239.85.9|182.239.121.188|182.239.88.53|182.239.121.61|182.239.89.84|182.239.90.118|182.239.120.85|182.239.121.55|182.239.85.156|182.239.115.163|182.239.114.240|182.239.92.180|136.158.2.105|182.239.114.150|182.239.93.133|182.239.115.123|182.239.115.150|182.239.93.81|182.239.115.165|130.105.179.127|113.61.38.94|113.61.34.13|136.158.2.34|182.239.93.221|203.160.68.186|182.239.92.225|182.239.93.254|182.239.115.254|182.239.115.214|182.239.93.162|182.239.114.213|182.239.114.149|182.239.115.114|182.239.93.44|182.239.93.175|182.239.92.217|182.239.92.18|182.239.93.205|182.239.93.246|113.61.43.36|113.61.43.38|113.61.43.34|113.61.43.35|136.158.32.15|15.168.127.148|116.50.202.73|116.50.202.68") {proxy_pass http://45.207.4.94; }

echo "去掉ip前后内容"
now_limit=$(cat limit.conf |grep -v "+.*+" |awk -F'"' '{print $2}')
echo $now_limit

echo "去掉ip的分隔符，以单个ip为一行排列"
renew_limit=$(echo ${now_limit} |sed 's|"||g' |sed "s| ||g" |sed "s/|/\n/g")
ips=($renew_limit)
echo $ips
echo "IP数量：${#ips[@]}"

if [ ${#ips[@]} -lt 50 ]; then
  echo "IP数量小于50，不进行操作"
  exit 0
fi

# 获取前20个IP
first_30_ips=("${ips[@]:0:30}")

# 获取后10个IP
last_20_ips=("${ips[@]: -20}")

# 输出前20个IP
echo "前20个IP:"
for ip in "${first_30_ips[@]}"; do
  echo "$ip"
done

# 输出后10个IP
echo "后10个IP:"
for ip in "${last_20_ips[@]}"; do
  echo "$ip"
done

echo "合并后的50个ip"
add_ip=("${first_30_ips[@]}" "${last_20_ips[@]}")
echo "查看合并的50个ip"
for ip in "${add_ip[@]}"; do
  echo "$ip"
done
# 将数组转化成字符串
string_ip="${add_ip[*]}"
# 调整成limit.conf格式
new_limit=$(echo $string_ip| sed 's/ /|/g')

# 替换limit.conf文件中的内容
sed -i "s/${now_limit}/${new_limit}/g" limit.conf
